In [1]:
import pandas as pd

In [22]:
df=pd.read_csv('student-dataset.csv')
##fetching first 5 rows
df.head(5)

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5
2,2,Dakota Blanco,United States of America,Oakland,37.80,-122.27,F,NaN,22,3.9,3.8,3.2,5.0,3,3.0,4
3,3,Natasha Yarusso,United States of America,Castro Valley,37.69,-122.09,F,NaN,20,3.3,2.8,3.2,5.0,5,2.0,4
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5

In [23]:
df.describe()

,id,latitude,longitude,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating
count,307.000000,307.000000,307.000000,0.0,307.000000,307.000000,307.000000,307.000000,307.000000,307.000000,307.000000,307.000000
mean,153.000000,32.863388,-64.539121,NaN,21.964169,3.369707,3.414332,3.446580,4.396417,3.986971,4.110749,4.188925
std,88.767487,13.498582,81.249146,NaN,1.248013,0.538724,0.476839,0.509081,0.996474,0.928749,0.823936,0.842193
min,0.000000,-33.450000,-123.130000,NaN,19.000000,1.500000,2.100000,1.400000,1.000000,1.000000,1.000000,1.000000
25%,76.500000,32.720000,-118.240000,NaN,21.000000,3.100000,3.100000,3.200000,4.000000,3.500000,4.000000,4.000000
50%,153.000000,34.390000,-99.140000,NaN,22.000000,3.500000,3.500000,3.600000,5.000000,4.000000,4.000000,4.000000
75%,229.500000,38.960000,-73.855000,NaN,23.000000,3.800000,3.800000,3.800000,5.000000,5.000000,5.000000,5.000000
max,306.000000,59.890000,139.750000,NaN,26.000000,4.000000,4.000000,4.000000,5.000000,5.000000,5.000000,5.000000

In [24]:
df.dtypes

id                      int64
name                      str
nationality               str
city                      str
latitude              float64
longitude             float64
gender                    str
ethnic.group          float64
age                     int64
english.grade         float64
math.grade            float64
sciences.grade        float64
language.grade        float64
portfolio.rating        int64
coverletter.rating    float64
refletter.rating        int64
dtype: object

In [25]:
##Handling Missing Values
df.isnull().any(axis=1)

0      True
1      True
2      True
3      True
4      True
       ...
302    True
303    True
304    True
305    True
306    True
Length: 307, dtype: bool

In [26]:
df.isnull().sum()

id                      0
name                    0
nationality             0
city                    0
latitude                0
longitude               0
gender                  0
ethnic.group          307
age                     0
english.grade           0
math.grade              0
sciences.grade          0
language.grade          0
portfolio.rating        0
coverletter.rating      0
refletter.rating        0
dtype: int64

In [29]:
##filling missing values with the mean of the colium
##let year have missing values
import pandas as pd
df=pd.read_csv('student-dataset.csv')
df['ethic_new']=df['ethnic.group'].fillna(df['ethnic.group'].mean())
df

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math.grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating,ethic_new
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4,NaN
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5,NaN
2,2,Dakota Blanco,United States of America,Oakland,37.80,-122.27,F,NaN,22,3.9,3.8,3.2,5.0,3,3.0,4,NaN
3,3,Natasha Yarusso,United States of America,Castro Valley,37.69,-122.09,F,NaN,20,3.3,2.8,3.2,5.0,5,2.0,4,NaN
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
302,302,Austin Haas,United States of America,Columbus,39.96,-83.00,M,NaN,20,3.6,3.7,3.1,5.0,4,5.0,5,NaN
303,303,Madison Fithian,United States of America,Los Angeles,34.05,-118.24,F,NaN,20,3.6,3.9,4.0,5.0,5,5.0,3,NaN
304,304,Zachary Mulvahill,United States of America,Los Angeles,34.05,-118.24,M,NaN,20,3.2,3.4,3.9,5.0,5,5.0,3,NaN
305,305,Eliana Michelsen,United States of America,Oakland,37.80,-122.27,F,NaN,23,3.0,2.8,2.9,5.0,4,4.0,5,NaN
306,306,Dane Whittemore,Canada,Toronto,43.67,-79.42,M,NaN,21,3.8,3.2,4.0,5.0,5,4.0,5,NaN

In [30]:
df.dtypes

id                      int64
name                      str
nationality               str
city                      str
latitude              float64
longitude             float64
gender                    str
ethnic.group          float64
age                     int64
english.grade         float64
math.grade            float64
sciences.grade        float64
language.grade        float64
portfolio.rating        int64
coverletter.rating    float64
refletter.rating        int64
ethic_new             float64
dtype: object

In [32]:
##Renaming Columns
df = df.rename(columns={
    'math.grade': 'math_grade'
})

df.head(5)

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math_grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating,ethic_new
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4,NaN
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5,NaN
2,2,Dakota Blanco,United States of America,Oakland,37.80,-122.27,F,NaN,22,3.9,3.8,3.2,5.0,3,3.0,4,NaN
3,3,Natasha Yarusso,United States of America,Castro Valley,37.69,-122.09,F,NaN,20,3.3,2.8,3.2,5.0,5,2.0,4,NaN
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5,NaN

In [33]:
##change datatype
df['age_new']=df['age'].astype(float)
df.head(2)

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math_grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating,ethic_new,age_new
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4,NaN,22.0
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5,NaN,22.0

In [34]:
## data manupulation
df['age_new']=df['age'].apply(lambda x:x*2)
df.head()

,id,name,nationality,city,latitude,longitude,gender,ethnic.group,age,english.grade,math_grade,sciences.grade,language.grade,portfolio.rating,coverletter.rating,refletter.rating,ethic_new,age_new
0,0,Kiana Lor,China,Suzhou,31.31,120.62,F,NaN,22,3.5,3.7,3.1,1.0,4,4.0,4,NaN,44
1,1,Joshua Lonaker,United States of America,Santa Clarita,34.39,-118.54,M,NaN,22,2.9,3.2,3.6,5.0,5,4.0,5,NaN,44
2,2,Dakota Blanco,United States of America,Oakland,37.80,-122.27,F,NaN,22,3.9,3.8,3.2,5.0,3,3.0,4,NaN,44
3,3,Natasha Yarusso,United States of America,Castro Valley,37.69,-122.09,F,NaN,20,3.3,2.8,3.2,5.0,5,2.0,4,NaN,40
4,4,Brooke Cazares,Brazil,São José dos Campos,-23.18,-45.88,F,NaN,21,3.7,2.6,3.4,1.0,4,4.0,5,NaN,42

In [37]:
##Data Aggregationg and Grouping
grouped_sum = df.groupby(['gender', 'nationality'])['math_grade'].sum()
print(grouped_sum)

gender  nationality
F       Bangladesh                    3.9
        Brazil                       19.6
        Canada                        9.6
        China                        18.5
        Colombia                      4.0
        Cuba                          2.8
        Dominican Republic            3.8
        El Salvador                   2.9
        Germany                       3.5
        India                        16.1
        Japan                        29.2
        Korea (Republic of)           5.7
        Mexico                       44.6
        Morocco                       3.6
        Myanmar                       3.4
        Netherlands                   3.5
        Nicaragua                     3.7
        Philippines                   3.6
        Russian Federation           16.4
        Thailand                      3.9
        Turkey                        2.6
        United Kingdom                2.6
        United States of America    308.4
M       Brazil                       10.8
        Canada                        8.5
        Chile                         3.7
        China                        30.7
        Colombia                     13.9
        Egypt                         3.5
        India                        10.1
        Japan                        16.8
        Korea (Republic of)           3.5
        Mexico                       33.2
        Pakistan                      8.8
        Peru                          3.1
        Poland                        3.8
        Russian Federation            3.9
        Spain                         7.5
        Tunisia                       3.1
        Turkey                        2.8
        Ukraine                       3.3
        United Kingdom                3.7
        United States of America    344.0
other   Canada                        3.0
        Mexico                        3.5
        United States of America      7.1
Name: math_grade, dtype: float64

In [40]:
##Aggregate multiple function
df.groupby(['gender', 'nationality']).agg({
    'age': ['mean', 'max'],
    'math_grade': ['mean'],
    'english.grade': ['mean'],
    'id': ['count']
})

                                       age     math_grade english.grade    id
                                      mean max       mean          mean count
gender nationality
F      Bangladesh                20.000000  20   3.900000      3.900000     1
       Brazil                    22.666667  24   3.266667      3.583333     6
       Canada                    20.666667  22   3.200000      3.600000     3
       China                     22.000000  24   3.700000      3.100000     5
       Colombia                  23.000000  23   4.000000      2.600000     1
       Cuba                      21.000000  21   2.800000      3.900000     1
       Dominican Republic        22.000000  22   3.800000      3.400000     1
       El Salvador               23.000000  23   2.900000      3.300000     1
       Germany                   20.000000  20   3.500000      3.200000     1
       India                     21.800000  22   3.220000      3.140000     5
       Japan                     22.625000  25   3.650000      3.462500     8
       Korea (Republic of)       22.500000  23   2.850000      3.750000     2
       Mexico                    21.307692  23   3.430769      3.500000    13
       Morocco                   21.000000  21   3.600000      2.400000     1
       Myanmar                   22.000000  22   3.400000      3.100000     1
       Netherlands               21.000000  21   3.500000      2.500000     1
       Nicaragua                 24.000000  24   3.700000      3.300000     1
       Philippines               24.000000  24   3.600000      3.900000     1
       Russian Federation        22.400000  24   3.280000      3.480000     5
       Thailand                  22.000000  22   3.900000      3.300000     1
       Turkey                    21.000000  21   2.600000      2.800000     1
       United Kingdom            22.000000  22   2.600000      3.600000     1
       United States of America  21.978022  24   3.389011      3.336264    91
M      Brazil                    22.000000  23   3.600000      3.566667     3
       Canada                    21.666667  24   2.833333      3.866667     3
       Chile                     21.000000  21   3.700000      3.700000     1
       China                     21.500000  23   3.837500      3.350000     8
       Colombia                  20.750000  22   3.475000      3.775000     4
       Egypt                     20.000000  20   3.500000      1.500000     1
       India                     21.333333  22   3.366667      2.766667     3
       Japan                     22.000000  24   3.360000      3.120000     5
       Korea (Republic of)       21.000000  21   3.500000      3.100000     1
       Mexico                    22.400000  24   3.320000      3.200000    10
       Pakistan                  22.333333  23   2.933333      3.400000     3
       Peru                      22.000000  22   3.100000      3.700000     1
       Poland                    21.000000  21   3.800000      3.900000     1
       Russian Federation        23.000000  23   3.900000      3.900000     1
       Spain                     22.500000  24   3.750000      3.450000     2
       Tunisia                   23.000000  23   3.100000      3.500000     1
       Turkey                    22.000000  22   2.800000      2.400000     1
       Ukraine                   22.000000  22   3.300000      3.100000     1
       United Kingdom            19.000000  19   3.700000      3.200000     1
       United States of America  22.090000  26   3.440000      3.418000   100
other  Canada                    22.000000  22   3.000000      3.200000     1
       Mexico                    23.000000  23   3.500000      3.100000     1
       United States of America  20.500000  21   3.550000      3.400000     2

In [45]:
##Merging and joining dataframes
df1 = pd.DataFrame({
    'student_id': [1, 2, 3, 4],
    'name': ['Kiana', 'Rahul', 'Emma', 'John'],
    'gender': ['F', 'M', 'F', 'M'],
    'math_grade': [3.7, 3.2, 3.9, 3.5]
})
df2 = pd.DataFrame({
    'student_id': [1, 2, 4, 5],
    'nationality': ['China', 'India', 'USA', 'UK'],
    'age': [22, 23, 25, 24]
})

df1

   student_id   name gender  math_grade
0           1  Kiana      F         3.7
1           2  Rahul      M         3.2
2           3   Emma      F         3.9
3           4   John      M         3.5

In [ ]:
pd.merge(df1,df2,on="student_id",how="inner")##common student_id will be consider

   student_id   name gender  math_grade nationality  age
0           1  Kiana      F         3.7       China   22
1           2  Rahul      M         3.2       India   23
2           4   John      M         3.5         USA   25

In [ ]:
pd.merge(df1,df2,on="student_id",how="outer")## both the student_id will be consider

   student_id   name gender  math_grade nationality   age
0           1  Kiana      F         3.7       China  22.0
1           2  Rahul      M         3.2       India  23.0
2           3   Emma      F         3.9         NaN   NaN
3           4   John      M         3.5         USA  25.0
4           5    NaN    NaN         NaN          UK  24.0

In [48]:
pd.merge(df1,df2,on="student_id",how="left")

   student_id   name gender  math_grade nationality   age
0           1  Kiana      F         3.7       China  22.0
1           2  Rahul      M         3.2       India  23.0
2           3   Emma      F         3.9         NaN   NaN
3           4   John      M         3.5         USA  25.0

In [49]:
pd.merge(df1,df2,on="student_id",how="right")

   student_id   name gender  math_grade nationality  age
0           1  Kiana      F         3.7       China   22
1           2  Rahul      M         3.2       India   23
2           4   John      M         3.5         USA   25
3           5    NaN    NaN         NaN          UK   24